import ton 

TON_CURRENCY = ton.get_ton_currency()
profile_text = "👛Кошелек"
referer_text = "👥Мои рефералы"
VIP_text = "💎PRO"
example_text = "Задания"

start_message = f"""***Добро пожаловать!***

🎁*** В этом боте вы сможете получать задания DM***

📈Курс DM:\n***1 DM = {TON_CURRENCY} РУБ***

🪙 ***Что такое DM Coin?***
DM Coin - это криптовалюта, привязанная к стоимости заданий,выполняй задания и получай сверх зарплаты свою криптовалюту.

🎉 ***Наш Airdrop:***
Мы предоставляем участникам Airdrop'а DM Coin в награду за их участие.

💼 ***Привлекай рефералов:***
Хотите увеличить свой доход? Пригласите своих друзей и знакомых в наш бот, и вы будете получать дополнительные 10 DM coin за каждого успешного реферала!
"""



vip_message = """
***Приветствуем вас, дорогой пользователь!***

Мы рады сообщить вам о запуске новых PRO-функций в нашем тг-боте. Теперь вы можете получить 𝗫𝟮 DMcoin за приглашение друзей в нашем боте по ссылке.

***Чтобы активировать PRO-функцию, вам необходимо:***

1️⃣ Пригласить не менее 5 друзей в наш бот по ссылке.

***После активации PRO-функций вы сможете:***

✔️ Получить 𝗫𝟮 DMcoin за приглашение друзей в нашем боте.
✔️ Участвовать в эксклюзивных криптовалютных заданиях.
✔️ Получить доступ к закрытому PRO-чату с другими PRO-пользователями.
"""

